development/this-site/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Technology used for this site | Simon Dobson</title>
<link rel="icon" href="../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono|Libre+Baskerville|Montserrat|Playfair+Display|Tangerine">
<link rel="stylesheet" href="../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../assets/css/code.css">
<link rel="stylesheet" href="../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../index.html">Home</a></li>
		    <li><a href="../../personal/">About&nbsp;me</a></li>
		    <li><a href="../../research/">Research</a></li>
		    <li><a href="../projects/">Software</a></li>
		    <li><a href="../../writing/">Writing</a></li>
		    <li><a href="../../personal/contact/">Contact</a></li>
		<li>
<a href="../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<h1>Technology used for this&nbsp;site</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-org7abc462" class="outline-2">
<h2 id="org7abc462">How this site is&nbsp;built</h2>
<div class="outline-text-2" id="text-org7abc462">
<p>
This site has been through several cycles of technology over the
years, including being hosted on a WordPress instance and using the
<a href="https://www.gnu.org/software/emacs-muse/manual/">muse</a> static site generator. This page describes the current
technological&nbsp;set-up.
</p>
</div>

<div id="outline-container-orgd8018e1" class="outline-3">
<h3 id="orgd8018e1">Design&nbsp;constraints</h3>
<div class="outline-text-3" id="text-orgd8018e1">
<ul class="org-ul">
<li>A static site that can just be stored in a file system and served
with a very simple web&nbsp;server</li>
<li>Minimal use of client-side&nbsp;JavaScript</li>
<li>Mostly&nbsp;text</li>
<li>…but some content is enriched with maths and&nbsp;images</li>
<li>…and some comes from diverse sources, like <a href="https://jupyter.org">Jupyter</a>&nbsp;notebooks</li>
<li>…and I&#8217;m quite particular about layout and&nbsp;typography</li>
</ul>
</div>
</div>

<div id="outline-container-orgc80c2e4" class="outline-3">
<h3 id="orgc80c2e4">Technology</h3>
<div class="outline-text-3" id="text-orgc80c2e4">
</div>
<div id="outline-container-orgb1fbe00" class="outline-4">
<h4 id="orgb1fbe00">Nikola</h4>
<div class="outline-text-4" id="text-orgb1fbe00">
<p>
The site is driven by <a href="https://getnikola.com">Nikola</a>, a static site generator written in
Python. I chose Nikola for a few&nbsp;reasons:
</p>

<ul class="org-ul">
<li>It&#8217;s written in Python, making it easy for me to&nbsp;understand</li>
<li>It&#8217;s very configurable, with a lot of pre-packaged <a href="https://themes.getnikola.com/">themes</a> and
<a href="https://plugins.getnikola.com/">plugins</a>, and easy to extend as the need&nbsp;arises</li>
<li>It&#8217;s reasonably&nbsp;well-documented</li>
<li>It&#8217;s extremely flexible in terms of input&nbsp;formats</li>
</ul>
<p>
The last point is the most important. Because I have content in
lots of different formats corresponding to the different
incarnations of this site, I need to be able to re-use those
different formats and not have to re-type or translate them. Not
only can Nikola use all that content, it also leverages to
strengths of the different file formats and allows them to be
integrated: markdown, reStructured text, plain text, <span class="caps">HTML</span>, Jupyter
notebooks, and (as we&#8217;ll see) org mode, with metadata either
inline or held in a&nbsp;separate <code>.meta</code> file. <i>Very</i> flexible,
although it does occasionally mean that the presentation of older
content is a bit&nbsp;off.
</p>
</div>
</div>

<div id="outline-container-org8e04554" class="outline-4">
<h4 id="org8e04554">Theme</h4>
<div class="outline-text-4" id="text-org8e04554">
<p>
Nikola is easy to theme and re-theme. I&#8217;ve used several different
themes over the years. The current one is based on <a href="https://themes.getnikola.com/v7/libretto/">Libretto</a>,
modified in several ways to adjust presentation and add things
like social sharing buttons and <span class="caps">RSS</span>&nbsp;subscriptions.
</p>
</div>
</div>

<div id="outline-container-orgd16321b" class="outline-4">
<h4 id="orgd16321b">Github&nbsp;pages</h4>
<div class="outline-text-4" id="text-orgd16321b">
<p>
I use <a href="https://github.com">Github</a> to version-control content, as well as obviously for
my software development. <a href="https://pages.github.com/">Githib pages</a> are web sites built directly
from code repos. I&#8217;ve used them to host my <a href="https://simondobson.org/introduction-to-epidemics/">book</a> on epidemic
modelling. Nikola comes with a plugin that publishes directly to
Github pages, making it easy to host and deploy the site. So I get
hosting for free alongside version&nbsp;control.
</p>
</div>
</div>

<div id="outline-container-org5edad7b" class="outline-4">
<h4 id="org5edad7b">Emacs and org&nbsp;mode</h4>
<div class="outline-text-4" id="text-org5edad7b">
<p>
Almost all my coding, writing, and note-taking is done in <a href="https://emacs.org">Emacs</a>
using <a href="https://orgmode.org/">Org mode</a>, a plain-text hypertext system with an amazing set
of capabilities. Nikola has an org mode plugin that can render org
markup alongside other content formats, so new content can be
written using the tool I usually use without having to re-write
older&nbsp;articles.
</p>

<p>
I draw a distinction between my notebook and my site – the
former is for my use and is probably unintelligible to anyone
else, the latter is material deliberately written for public
consumption. I have a set of Emacs functions to simplify moving
from one to the&nbsp;other.
</p>
</div>
</div>

<div id="outline-container-org090dd01" class="outline-4">
<h4 id="org090dd01">JavaScript</h4>
<div class="outline-text-4" id="text-org090dd01">
<p>
<span class="dquo">&#8220;</span>Minimal&#8221;, not &#8220;no&#8221;,&nbsp;JavaScript.
</p>

<p>
Laying-out maths is a complicated process that is best performed
client-side. I use <a href="http://mathjax.org">MathJax</a> for this, which takes the <a href="https://www.latex-project.org/">LaTeX</a> maths
markup that almost all scientists use and renders it in&nbsp;<span class="caps">HTML</span>.
</p>

<p>
I also have some small fragments of JavaScript elsewhere around
the site, for example to provide the &#8220;Share to Mastodon&#8221; buttons
on&nbsp;articles.
</p>
</div>
</div>
</div>
</div>
	    </div>
	</article>
</div>

	<!-- Social sharing section -->

	<!-- Tag Section -->

	<!-- Post Navigation links -->

    <!-- Page Footer -->
    <section class="footer-sidebar clear" role="complementary"><div class="widget-block">
	    <aside class="widget"><h2 class="widget-title">Simon&nbsp;Dobson</h2>
		<div class="widget-text">Aut tace aut loquere meliora silentio</div>
	    </aside>
</div>
    </section><!-- Extra JavaScript --><!-- Site Attributions --><footer class="site-footer" role="contentinfo"><div class="site-info">
	    <p></p>
	    <p>
	      Built with free and open-source software.
	      Powered by <a href="https://getnikola.com/">Nikola</a> using a theme based on
	      <a href="https://themes.getnikola.com/v7/libretto/">Libretto</a>.
	    </p>
	    <p>
	      All content Copyright © 2010–2024 Simon Dobson and licensed under
	      <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/"><span class="caps">CC</span>-<span class="caps">BY</span>-<span class="caps">NC</span>-<span class="caps">SA</span>-4.0</a>
	      unless otherwise&nbsp;noted.
	    </p>
	</div>
	<div class="social">
	    <ul class="menu"></ul>
</div>
    </footer>
</body>
</html>